const helpDict = {
  '露春': '谜面不露春，是指谜面上不会出现谜底的任何一个字。谜目则无此限制，可以出现谜底中的字',
  '探骊格': '探骊格又名骊珠格，如同深海探宝，不指定谜目，要求将谜目谜底一起猜出，谜目谜底连起来与谜面相扣。请注意谜目谜底间用空格分隔',
  '卷帘格': '卷帘格谜底三字及以上，意为『倒卷珠帘』，要把谜底倒过来读，如谜底是『孙行者』，则要读作『者行孙』',
  '离合字': '离合字是将一个字拆成多个部件，如：好女子、弓长张',
  '空格': '谜底为多个组合时用空格隔开，如：中秋 端午',
  '梨花格': '梨花格是谐音格，可以放心使用谐音梗',
  '徐妃格': '取『只得徐妃半面妆』之意，去掉谜底相同的偏旁',
  '摘匾格': '类似徐妃格，去掉谜底相同的部首',
  '白头格': '首字谐音',
  '折巾格': '将谜底第一字左右拆开成两个字，只取其半边字连下文来读',
  '蜂腰格': '蜂腰格，又名中分格、断绵格。谜底须三字以上的单数词句，但中间一字要上下分开作两字读',
  '秋千格': '秋千格，谜底两字倒读。其实就是两字版本的卷帘格',
  '双钩格': '谜底前两字和后两字双换位置读，如 1234 读作 3412。又作双字秋千格',
  '解带格': '解带格，又名鸿沟格、挖心格、比干格、抹胸格、折腰格。谜底为三字及以上奇数，去掉谜底中间一字与谜面相扣',
  '蝇头格': '蝇头格，又名垫巾格。谜底第一字上下分开作两个字读',
  '玉带格': '玉带格，谜底字数必须是奇数，中间一字是谐音字',
  '睡鸭格': '谜底前两字对调',
  '遥对格': '约等于对对联',
  '上楼格': '谜底尾字调到最前',
  '下楼格': '谜底首字调到最后',
  '求凰格': '典出司马相如《凤求凰》，对出下联即得谜底。谜底格式不一，形如『对某某』、『连某某』、『某某对』皆有可能',
  '只履格': '谜底尾字左右拆开，只取其一半读',
  '粉底格': '最后一字谐音',
  '通假字': '格式: A通B',
  '游目谜': '谜目藏在谜面中',
}

function alias (name, ...names) {
  names.forEach(n => {
    helpDict[n] = helpDict[name]
  })
}

alias('探骊格', '骊珠格')
alias('蜂腰格', '中分格', '断绵格')
alias('解带格', '鸿沟格', '挖心格', '比干格', '抹胸格', '折腰格')
alias('蝇头格', '垫巾格')
alias('睡鸭格', '掉首格')

module.exports = helpDict
